{
  "19999": {
    "id": "19999",
    "contributorID": "11111",
    "name": "Michael Ding",
    "title": "The Beauty of Southern Raiders",
    "description": "My take on the most important episode to Katara's character development",
    "subtitle": "Katara comes alive",
    "text": "Southern Raiders is truly an excellent episode that addressed my biggest question about Katara: would we ever see the show explore her mother's murder, and if Katara were to confront her mother's murderer, what would she do? The episode is fantastic character development for Katara, even so late in the show. One can only imagine how much anger she has harbored for years now towards the Fire Nation, as a substitute for her killer's unknown identity. Once that identity is revealed, we wonder if Katara will choose the path of revenge or forgiveness. And if she were to choose revenge, how so? What will it reveal about her? Will it give her solace? When I saw Katara bloodbend the Fire Nation soldier in order to retrieve information about the killer, I was worried that she had lost herself to hatred and vengeance, and would no longer be the calm and collected 'mother' of the group. In the scene where the killer and her are finally face-to-face, we get a beautiful answer to our many  questions — Katara doesn't choose revenge or forgiveness, but she realizes that the killer is a soldier, his act a cruel reality of war. Rather than violently stab her mother's killer to death, she takes controls of her emotions, and refocuses them to what is actually important in the present — winning the war. In doing so, she not only prevents her personal feelings from getting in the way of winning the war, but also saves herself from changing for the worse because of the war. She preserves her morality, and leaves us all with a message — accept the past, confront the present, and strive for a better future.",
    "Date": "12/13/20 8:30am"
  },
  "99999": {
    "id": "99999",
    "contributorID": "20000",
    "name": "Damus",
    "title": "This is a test",
    "description": "testing file ",
    "subtitle": "test test ",
    "text": "This file is used as a test to delete.",
    "Date": "12/15/20 8:30am"
  }
}
