[
  {
    "user": "Butter",
    "title": "The Beauty of Southern Raiders",
    "date": "October 23, 2010",
    "tags": ["Avatar", " Katara", " Season 3"],
    "content": "Southern Raiders is truly an excellent episode that addressed my biggest question about Katara: would we ever see the show explore her mother's murder, and if Katara were to confront her mother's murderer, what would she do? The episode is fantastic character development for Katara, even so late in the show. One can only imagine how much anger she has harbored for years now towards the Fire Nation, as a substitute for her killer's unknown identity. Once that identity is revealed, we wonder if Katara will choose the path of revenge or forgiveness. And if she were to choose revenge, how so? What will it reveal about her? Will it give her solace?\n When I saw Katara bloodbend the Fire Nation soldier in order to retrieve information about the killer, I was worried that she had lost herself to hatred and vengeance, and would no longer be the calm and collected 'mother' of the group. In the scene where the killer and her are finally face-to-face, we get a beautiful answer to our many  questions — Katara doesn't choose revenge or forgiveness, but she realizes that the killer is a soldier, his act a cruel reality of war. Rather than violently stab her mother's killer to death, she takes controls of her emotions, and refocuses them to what is actually important in the present — winning the war. In doing so, she not only prevents her personal feelings from getting in the way of winning the war, but also saves herself from changing for the worse because of the war. She preserves her morality, and leaves us all with a message — accept the past, confront the present, and strive for a better future.",
    "content2":"",
    "image":"images/southern_raiders.jpg",
    "descrip": "My take on the most important episode to Katara's character development"
  },
  {
    "user": "Woash",
    "title": "Why Korra is Better",
    "date": "April 2, 2015",
    "tags": ["Avatar", " Korra"],
    "content": "There's a widespread belief that sequels are almost certainly worse than the original. And to an extent, it makes sense. There's a certain excitement in the creation of a new universe, with new characters, personalities, stories to tell — it's so fresh for both the creator and the viewer, and developing or watching the show or movie are both exciting experiences. By the time the second iteration comes around, that lightbulb that provided inspiration for most of the first iteration may have vanished from then mind of the creator, who now has to rely on the textbook techniques and fan service to deliver a strong sequel. Yet for those who can retain that lightbulb, and stay true to their first vision of their created universe while also incorporating feedback, there is unlimited potential for the sequel to not only continue the success of the first iteration, but also  tap into new, deeper themes that the original simply did not have the time to explore.\n  Legends of Korra, in my opinion, exemplifies the latter; it continues to build on the beautiful and creative world of Avatar: The Last Airbender, has a plot line that is dynamic, original,and refreshes every season, and — in my opinion, most significantly — features three incredible villains that help the show navigate some truly complex themes like equality, freedom, and order. While the original most certainly included themes and actions that you don't typically see in a kid's show, such as intercultural relations, genocide, and imperialism, it still ultimately collapsed to one cliché: good vs. evil. There's absolutely no doubt that Azula, Ozai, and the Fire Nation are the bad guys, and this makes for an easy plot. In Korra, however, the villains argue for very sympathizable causes. In Season 1, Amon addresses a question that wasn't explored at all in the original — how do you maintain equality in a society where some have a tremendous power to manipulate elements while others don't? What inequalities arise, and how should the world deal with them? Amon had an extreme answer — strip all benders of their abilities, and everyone will be truly equal. When we then hear anecdotes of people without powers being subject to violence and manipulation from benders, Amon's platform starts to make a lot of sense. Why should certain people be born with an undoubtably significant advantage? Similar ambiguities between good and evil arise in the third and fourth seasons, and they're what makes the show so much more than just a kid's show. Korra has the same fun, lighthearted scenes and characters that made Avatar such a fun watch, while also really making you think about certain issues in their universe that apply to ours to. For example, how do freedom and order coexist? Where do we draw that line?",
    "content2":"",
    "image":"images/korra_villains.jpg",
    "descrip": "How the show's villains are unsurpassed"
  },
  {
    "user": "Michael",
    "title": "Why Avatar Remains My Favorite ",
    "date": "May 20, 2020",
    "tags": ["Avatar", " Korra"],
    "content": "I do think, in most respects, that Korra is the 'better' show, incorprating both the strengths of a 'kid's show' like Avatar in addition to the complex real-world themes of shows meant for adults. Nonetheless, whenever I'm in the mood to once again immerse myself in the Avatar universe, I'll rewatch an episode from the original instead of the sequel 100 out of 100 times. Whether I'm happy and excited to rewatch the series finale, sad and in need of 'Tales of Ba Sing Se', or just chilling with 'The Avatar and the Firelord',  there's an episode for basically every mood, even after I've watched them more than eight times.\n  So why do I have a preference for the original when rewatching? Well, my best guess is that the sequel is much more plot-driven, and it doesn't have as many 'filler' episodes. It's more like a modern show, and while the emphasis on plot really strengthens the prescense of the major themes while also really making the show a real pleasure to binge, it doesn't allow many episodes to truly stand out on their own. On the other hand, the abscense of significant plot in many Avatar episodes actually seems to have given the creators significantly more possibilities, which then allows them to get really creative in order to show character development and produce memorable moments in creative ways. 'Tales of Ba Sing Se', for example, has no significant contribution to the overarching plot — it is, in every way, a filler episode. 'Zuko Alone' is a similar example that doesn't contribute to the plot at all. Yet these two consistently rank in fan's top five episodes of the whole series because of how they developed the characters (especially for Zuko in 'Zuko Alone'), and how they are remembered by fans. 'Tales of Iroh' is one of the saddest things I've ever watched, and it humanizes Iroh and sets him apart from the cutthroat, evil Fire Nation of which he is (technically) still a part! 'Zuko Alone' is all about character building. What happens to Zuko when he's all alone on his journey, with no Avatar in sight, no pressure to restore his honor, and just a dirt path and some tumbleweeds in a very Western-style story setting? Well, we see him try to deny his identity as a disgraced Fire Nation prince, but ends up understanding that that will forever be a part of who he is. And that's the key — you may be ashamed from it, you may walk away from it, but you shouldn't deny an experience's belonging in your life story. Only by accepting it — or perhaps even embracing it — can you move on to improve yourself. It's episodes like these that really do make Avatar such a memorable and cherished show." ,
    "content2":"",
    "image":"images/Iroh_forgives_Zuko.png",
    "descrip": "The Best Show Ever"
  }
]
